Revit 2024 API
Element.GetSubelements Method
 Returns the collection of element subelements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public IList<Subelement> GetSubelements()
Visual Basic
Public Function GetSubelements As IList(Of Subelement)
Visual C++
public:
IList<Subelement^>^ GetSubelements()
Return Value
 The collection of element subelements.
Remarks
 This collection will not include the Element itself.
See Also
Element Class
Autodesk.Revit.DB Namespace